#!/usr/bin/env ruby
# -*- encoding: utf-8 -*-

# Квадратное уравнение (усложненное задание). Пользователь вводит 3 коэффициента a, b и с.
# Программа вычисляет дискриминант (D) и корни уравнения (x1 и x2, если они есть) и выводит значения дискриминанта и корней на экран.
# При этом возможны следующие варианты:
#   Если D > 0, то выводим дискриминант и 2 корня
#   Если D = 0, то выводим дискриминант и 1 корень (т.к. они в этом случае равны)
#   Если D < 0, то выводим дискриминант и сообщение "Корней нет"
#Подсказки: Вот здесь описан алгоритм решения с блок-схемой11.
# Для вычисления квадратного корня, нужно использовать `Math.sqrt`, например, `Math.sqrt(16)` вернет 4, т.е. квадратный корень из 16.

puts "a:"
a = gets.to_f
puts "b:"
b = gets.to_f
puts "c:"
c = gets.to_f

d = b**2 - 4*a*c

if d>0
  cc = Math.sqrt(d)
  x1 = (-b + cc)/(2*a)
  x2 = (-b - cc)/(2*a)
  puts "дискриминант: #{d}, корень x1: #{x1}, корень x2: #{x2}"
elsif d==0
  x1 = -b/(2*a)
  puts "дискриминант: #{d}, корень: #{x1}"
else
  puts "Корней нет"
end